MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1784/mcu.h
// Register: SLRCOND
#define SLRCOND SLRCOND
extern volatile unsigned char           SLRCOND             __at(0x30F);
#ifndef _LIB_BUILD
asm("SLRCOND equ 030Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRCOND0               :1;
        unsigned SLRCOND1               :1;
        unsigned SLRCOND2               :1;
        unsigned SLRCOND3               :1;
        unsigned SLRCOND4               :1;
        unsigned SLRCOND5               :1;
        unsigned SLRCOND6               :1;
        unsigned SLRCOND7               :1;
    };
    struct {
        unsigned SLRCOND                :8;
    };
} SLRCONDbits_t;
extern volatile SLRCONDbits_t SLRCONDbits __at(0x30F);
// bitfield macros
#define _SLRCOND_SLRCOND0_POSN                              0x0
#define _SLRCOND_SLRCOND0_POSITION                          0x0
#define _SLRCOND_SLRCOND0_SIZE                              0x1
#define _SLRCOND_SLRCOND0_LENGTH                            0x1
#define _SLRCOND_SLRCOND0_MASK                              0x1
#define _SLRCOND_SLRCOND1_POSN                              0x1
#define _SLRCOND_SLRCOND1_POSITION                          0x1
#define _SLRCOND_SLRCOND1_SIZE                              0x1
#define _SLRCOND_SLRCOND1_LENGTH                            0x1
#define _SLRCOND_SLRCOND1_MASK                              0x2
#define _SLRCOND_SLRCOND2_POSN                              0x2
#define _SLRCOND_SLRCOND2_POSITION                          0x2
#define _SLRCOND_SLRCOND2_SIZE                              0x1
#define _SLRCOND_SLRCOND2_LENGTH                            0x1
#define _SLRCOND_SLRCOND2_MASK                              0x4
#define _SLRCOND_SLRCOND3_POSN                              0x3
#define _SLRCOND_SLRCOND3_POSITION                          0x3
#define _SLRCOND_SLRCOND3_SIZE                              0x1
#define _SLRCOND_SLRCOND3_LENGTH                            0x1
#define _SLRCOND_SLRCOND3_MASK                              0x8
#define _SLRCOND_SLRCOND4_POSN                              0x4
#define _SLRCOND_SLRCOND4_POSITION                          0x4
#define _SLRCOND_SLRCOND4_SIZE                              0x1
#define _SLRCOND_SLRCOND4_LENGTH                            0x1
#define _SLRCOND_SLRCOND4_MASK                              0x10
#define _SLRCOND_SLRCOND5_POSN                              0x5
#define _SLRCOND_SLRCOND5_POSITION                          0x5
#define _SLRCOND_SLRCOND5_SIZE                              0x1
#define _SLRCOND_SLRCOND5_LENGTH                            0x1
#define _SLRCOND_SLRCOND5_MASK                              0x20
#define _SLRCOND_SLRCOND6_POSN                              0x6
#define _SLRCOND_SLRCOND6_POSITION                          0x6
#define _SLRCOND_SLRCOND6_SIZE                              0x1
#define _SLRCOND_SLRCOND6_LENGTH                            0x1
#define _SLRCOND_SLRCOND6_MASK                              0x40
#define _SLRCOND_SLRCOND7_POSN                              0x7
#define _SLRCOND_SLRCOND7_POSITION                          0x7
#define _SLRCOND_SLRCOND7_SIZE                              0x1
#define _SLRCOND_SLRCOND7_LENGTH                            0x1
#define _SLRCOND_SLRCOND7_MASK                              0x80
#define _SLRCOND_SLRCOND_POSN                               0x0
#define _SLRCOND_SLRCOND_POSITION                           0x0
#define _SLRCOND_SLRCOND_SIZE                               0x8
#define _SLRCOND_SLRCOND_LENGTH                             0x8
#define _SLRCOND_SLRCOND_MASK                               0xFF

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0x310);
#ifndef _LIB_BUILD
asm("SLRCONE equ 0310h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRCONE0               :1;
        unsigned SLRCONE1               :1;
        unsigned SLRCONE2               :1;
    };
    struct {
        unsigned SLRCONE                :3;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0x310);
// bitfield macros
#define _SLRCONE_SLRCONE0_POSN                              0x0
#define _SLRCONE_SLRCONE0_POSITION                          0x0
#define _SLRCONE_SLRCONE0_SIZE                              0x1
#define _SLRCONE_SLRCONE0_LENGTH                            0x1
#define _SLRCONE_SLRCONE0_MASK                              0x1
#define _SLRCONE_SLRCONE1_POSN                              0x1
#define _SLRCONE_SLRCONE1_POSITION                          0x1
#define _SLRCONE_SLRCONE1_SIZE                              0x1
#define _SLRCONE_SLRCONE1_LENGTH                            0x1
#define _SLRCONE_SLRCONE1_MASK                              0x2
#define _SLRCONE_SLRCONE2_POSN                              0x2
#define _SLRCONE_SLRCONE2_POSITION                          0x2
#define _SLRCONE_SLRCONE2_SIZE                              0x1
#define _SLRCONE_SLRCONE2_LENGTH                            0x1
#define _SLRCONE_SLRCONE2_MASK                              0x4
#define _SLRCONE_SLRCONE_POSN                               0x0
#define _SLRCONE_SLRCONE_POSITION                           0x0
#define _SLRCONE_SLRCONE_SIZE                               0x3
#define _SLRCONE_SLRCONE_LENGTH                             0x3
#define _SLRCONE_SLRCONE_MASK                               0x7

// Register: CCPR3
#define CCPR3 CCPR3
extern volatile unsigned short          CCPR3               __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR3 equ 0311h");
#endif

// Register: CCPR3L
#define CCPR3L CCPR3L
extern volatile unsigned char           CCPR3L              __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR3L equ 0311h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR3L                 :8;
    };
} CCPR3Lbits_t;
extern volatile CCPR3Lbits_t CCPR3Lbits __at(0x311);
// bitfield macros
#define _CCPR3L_CCPR3L_POSN                                 0x0
#define _CCPR3L_CCPR3L_POSITION                             0x0
#define _CCPR3L_CCPR3L_SIZE                                 0x8
#define _CCPR3L_CCPR3L_LENGTH                               0x8
#define _CCPR3L_CCPR3L_MASK                                 0xFF

// Register: CCPR3H
#define CCPR3H CCPR3H
extern volatile unsigned char           CCPR3H              __at(0x312);
#ifndef _LIB_BUILD
asm("CCPR3H equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR3H                 :8;
    };
} CCPR3Hbits_t;
extern volatile CCPR3Hbits_t CCPR3Hbits __at(0x312);
// bitfield macros
#define _CCPR3H_CCPR3H_POSN                                 0x0
#define _CCPR3H_CCPR3H_POSITION                             0x0
#define _CCPR3H_CCPR3H_SIZE                                 0x8
#define _CCPR3H_CCPR3H_LENGTH                               0x8
#define _CCPR3H_CCPR3H_MASK                                 0xFF

