MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1784/mcu.h
extern volatile OPA2CONbits_t OPA2CONbits __at(0x513);
// bitfield macros
#define _OPA2CON_OPA2PCH0_POSN                              0x0
#define _OPA2CON_OPA2PCH0_POSITION                          0x0
#define _OPA2CON_OPA2PCH0_SIZE                              0x1
#define _OPA2CON_OPA2PCH0_LENGTH                            0x1
#define _OPA2CON_OPA2PCH0_MASK                              0x1
#define _OPA2CON_OPA2PCH1_POSN                              0x1
#define _OPA2CON_OPA2PCH1_POSITION                          0x1
#define _OPA2CON_OPA2PCH1_SIZE                              0x1
#define _OPA2CON_OPA2PCH1_LENGTH                            0x1
#define _OPA2CON_OPA2PCH1_MASK                              0x2
#define _OPA2CON_OPA2PCH_POSN                               0x0
#define _OPA2CON_OPA2PCH_POSITION                           0x0
#define _OPA2CON_OPA2PCH_SIZE                               0x3
#define _OPA2CON_OPA2PCH_LENGTH                             0x3
#define _OPA2CON_OPA2PCH_MASK                               0x7
#define _OPA2CON_OPA2SP_POSN                                0x6
#define _OPA2CON_OPA2SP_POSITION                            0x6
#define _OPA2CON_OPA2SP_SIZE                                0x1
#define _OPA2CON_OPA2SP_LENGTH                              0x1
#define _OPA2CON_OPA2SP_MASK                                0x40
#define _OPA2CON_OPA2EN_POSN                                0x7
#define _OPA2CON_OPA2EN_POSITION                            0x7
#define _OPA2CON_OPA2EN_SIZE                                0x1
#define _OPA2CON_OPA2EN_LENGTH                              0x1
#define _OPA2CON_OPA2EN_MASK                                0x80
#define _OPA2CON_PCH_POSN                                   0x0
#define _OPA2CON_PCH_POSITION                               0x0
#define _OPA2CON_PCH_SIZE                                   0x3
#define _OPA2CON_PCH_LENGTH                                 0x3
#define _OPA2CON_PCH_MASK                                   0x7
#define _OPA2CON_SP_POSN                                    0x6
#define _OPA2CON_SP_POSITION                                0x6
#define _OPA2CON_SP_SIZE                                    0x1
#define _OPA2CON_SP_LENGTH                                  0x1
#define _OPA2CON_SP_MASK                                    0x40
#define _OPA2CON_EN_POSN                                    0x7
#define _OPA2CON_EN_POSITION                                0x7
#define _OPA2CON_EN_SIZE                                    0x1
#define _OPA2CON_EN_LENGTH                                  0x1
#define _OPA2CON_EN_MASK                                    0x80
#define _OPA2CON_PCH0_POSN                                  0x0
#define _OPA2CON_PCH0_POSITION                              0x0
#define _OPA2CON_PCH0_SIZE                                  0x1
#define _OPA2CON_PCH0_LENGTH                                0x1
#define _OPA2CON_PCH0_MASK                                  0x1
#define _OPA2CON_PCH1_POSN                                  0x1
#define _OPA2CON_PCH1_POSITION                              0x1
#define _OPA2CON_PCH1_SIZE                                  0x1
#define _OPA2CON_PCH1_LENGTH                                0x1
#define _OPA2CON_PCH1_MASK                                  0x2

// Register: OPA3CON
#define OPA3CON OPA3CON
extern volatile unsigned char           OPA3CON             __at(0x515);
#ifndef _LIB_BUILD
asm("OPA3CON equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA3PCH0               :1;
        unsigned OPA3PCH1               :1;
    };
    struct {
        unsigned OPA3PCH                :3;
        unsigned                        :3;
        unsigned OPA3SP                 :1;
        unsigned OPA3EN                 :1;
    };
    struct {
        unsigned PCH                    :3;
        unsigned                        :3;
        unsigned SP                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
    };
} OPA3CONbits_t;
extern volatile OPA3CONbits_t OPA3CONbits __at(0x515);
// bitfield macros
#define _OPA3CON_OPA3PCH0_POSN                              0x0
#define _OPA3CON_OPA3PCH0_POSITION                          0x0
#define _OPA3CON_OPA3PCH0_SIZE                              0x1
#define _OPA3CON_OPA3PCH0_LENGTH                            0x1
#define _OPA3CON_OPA3PCH0_MASK                              0x1
#define _OPA3CON_OPA3PCH1_POSN                              0x1
#define _OPA3CON_OPA3PCH1_POSITION                          0x1
#define _OPA3CON_OPA3PCH1_SIZE                              0x1
#define _OPA3CON_OPA3PCH1_LENGTH                            0x1
#define _OPA3CON_OPA3PCH1_MASK                              0x2
#define _OPA3CON_OPA3PCH_POSN                               0x0
#define _OPA3CON_OPA3PCH_POSITION                           0x0
#define _OPA3CON_OPA3PCH_SIZE                               0x3
#define _OPA3CON_OPA3PCH_LENGTH                             0x3
#define _OPA3CON_OPA3PCH_MASK                               0x7
#define _OPA3CON_OPA3SP_POSN                                0x6
#define _OPA3CON_OPA3SP_POSITION                            0x6
#define _OPA3CON_OPA3SP_SIZE                                0x1
#define _OPA3CON_OPA3SP_LENGTH                              0x1
#define _OPA3CON_OPA3SP_MASK                                0x40
#define _OPA3CON_OPA3EN_POSN                                0x7
#define _OPA3CON_OPA3EN_POSITION                            0x7
#define _OPA3CON_OPA3EN_SIZE                                0x1
#define _OPA3CON_OPA3EN_LENGTH                              0x1
#define _OPA3CON_OPA3EN_MASK                                0x80
#define _OPA3CON_PCH_POSN                                   0x0
#define _OPA3CON_PCH_POSITION                               0x0
#define _OPA3CON_PCH_SIZE                                   0x3
#define _OPA3CON_PCH_LENGTH                                 0x3
#define _OPA3CON_PCH_MASK                                   0x7
#define _OPA3CON_SP_POSN                                    0x6
#define _OPA3CON_SP_POSITION                                0x6
#define _OPA3CON_SP_SIZE                                    0x1
#define _OPA3CON_SP_LENGTH                                  0x1
#define _OPA3CON_SP_MASK                                    0x40
#define _OPA3CON_EN_POSN                                    0x7
#define _OPA3CON_EN_POSITION                                0x7
#define _OPA3CON_EN_SIZE                                    0x1
#define _OPA3CON_EN_LENGTH                                  0x1
#define _OPA3CON_EN_MASK                                    0x80
#define _OPA3CON_PCH0_POSN                                  0x0
#define _OPA3CON_PCH0_POSITION                              0x0
#define _OPA3CON_PCH0_SIZE                                  0x1
#define _OPA3CON_PCH0_LENGTH                                0x1
#define _OPA3CON_PCH0_MASK                                  0x1
#define _OPA3CON_PCH1_POSN                                  0x1
#define _OPA3CON_PCH1_POSITION                              0x1
#define _OPA3CON_PCH1_SIZE                                  0x1
#define _OPA3CON_PCH1_LENGTH                                0x1
#define _OPA3CON_PCH1_MASK                                  0x2

