MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1784/mcu.h
// Register: PSMC3CLK
#define PSMC3CLK PSMC3CLK
extern volatile unsigned char           PSMC3CLK            __at(0x854);
#ifndef _LIB_BUILD
asm("PSMC3CLK equ 0854h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3CSRC0                :1;
        unsigned P3CSRC1                :1;
        unsigned                        :2;
        unsigned P3CPRE0                :1;
        unsigned P3CPRE1                :1;
    };
    struct {
        unsigned P3CSRC                 :2;
        unsigned                        :2;
        unsigned P3CPRE                 :2;
    };
} PSMC3CLKbits_t;
extern volatile PSMC3CLKbits_t PSMC3CLKbits __at(0x854);
// bitfield macros
#define _PSMC3CLK_P3CSRC0_POSN                              0x0
#define _PSMC3CLK_P3CSRC0_POSITION                          0x0
#define _PSMC3CLK_P3CSRC0_SIZE                              0x1
#define _PSMC3CLK_P3CSRC0_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC0_MASK                              0x1
#define _PSMC3CLK_P3CSRC1_POSN                              0x1
#define _PSMC3CLK_P3CSRC1_POSITION                          0x1
#define _PSMC3CLK_P3CSRC1_SIZE                              0x1
#define _PSMC3CLK_P3CSRC1_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC1_MASK                              0x2
#define _PSMC3CLK_P3CPRE0_POSN                              0x4
#define _PSMC3CLK_P3CPRE0_POSITION                          0x4
#define _PSMC3CLK_P3CPRE0_SIZE                              0x1
#define _PSMC3CLK_P3CPRE0_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE0_MASK                              0x10
#define _PSMC3CLK_P3CPRE1_POSN                              0x5
#define _PSMC3CLK_P3CPRE1_POSITION                          0x5
#define _PSMC3CLK_P3CPRE1_SIZE                              0x1
#define _PSMC3CLK_P3CPRE1_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE1_MASK                              0x20
#define _PSMC3CLK_P3CSRC_POSN                               0x0
#define _PSMC3CLK_P3CSRC_POSITION                           0x0
#define _PSMC3CLK_P3CSRC_SIZE                               0x2
#define _PSMC3CLK_P3CSRC_LENGTH                             0x2
#define _PSMC3CLK_P3CSRC_MASK                               0x3
#define _PSMC3CLK_P3CPRE_POSN                               0x4
#define _PSMC3CLK_P3CPRE_POSITION                           0x4
#define _PSMC3CLK_P3CPRE_SIZE                               0x2
#define _PSMC3CLK_P3CPRE_LENGTH                             0x2
#define _PSMC3CLK_P3CPRE_MASK                               0x30

// Register: PSMC3OEN
#define PSMC3OEN PSMC3OEN
extern volatile unsigned char           PSMC3OEN            __at(0x855);
#ifndef _LIB_BUILD
asm("PSMC3OEN equ 0855h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3OEA                  :1;
        unsigned P3OEB                  :1;
        unsigned P3OEC                  :1;
        unsigned P3OED                  :1;
        unsigned P3OEE                  :1;
        unsigned P3OEF                  :1;
    };
} PSMC3OENbits_t;
extern volatile PSMC3OENbits_t PSMC3OENbits __at(0x855);
// bitfield macros
#define _PSMC3OEN_P3OEA_POSN                                0x0
#define _PSMC3OEN_P3OEA_POSITION                            0x0
#define _PSMC3OEN_P3OEA_SIZE                                0x1
#define _PSMC3OEN_P3OEA_LENGTH                              0x1
#define _PSMC3OEN_P3OEA_MASK                                0x1
#define _PSMC3OEN_P3OEB_POSN                                0x1
#define _PSMC3OEN_P3OEB_POSITION                            0x1
#define _PSMC3OEN_P3OEB_SIZE                                0x1
#define _PSMC3OEN_P3OEB_LENGTH                              0x1
#define _PSMC3OEN_P3OEB_MASK                                0x2
#define _PSMC3OEN_P3OEC_POSN                                0x2
#define _PSMC3OEN_P3OEC_POSITION                            0x2
#define _PSMC3OEN_P3OEC_SIZE                                0x1
#define _PSMC3OEN_P3OEC_LENGTH                              0x1
#define _PSMC3OEN_P3OEC_MASK                                0x4
#define _PSMC3OEN_P3OED_POSN                                0x3
#define _PSMC3OEN_P3OED_POSITION                            0x3
#define _PSMC3OEN_P3OED_SIZE                                0x1
#define _PSMC3OEN_P3OED_LENGTH                              0x1
#define _PSMC3OEN_P3OED_MASK                                0x8
#define _PSMC3OEN_P3OEE_POSN                                0x4
#define _PSMC3OEN_P3OEE_POSITION                            0x4
#define _PSMC3OEN_P3OEE_SIZE                                0x1
#define _PSMC3OEN_P3OEE_LENGTH                              0x1
#define _PSMC3OEN_P3OEE_MASK                                0x10
#define _PSMC3OEN_P3OEF_POSN                                0x5
#define _PSMC3OEN_P3OEF_POSITION                            0x5
#define _PSMC3OEN_P3OEF_SIZE                                0x1
#define _PSMC3OEN_P3OEF_LENGTH                              0x1
#define _PSMC3OEN_P3OEF_MASK                                0x20

// Register: PSMC3POL
#define PSMC3POL PSMC3POL
extern volatile unsigned char           PSMC3POL            __at(0x856);
#ifndef _LIB_BUILD
asm("PSMC3POL equ 0856h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3POLA                 :1;
        unsigned P3POLB                 :1;
        unsigned P3POLC                 :1;
        unsigned P3POLD                 :1;
        unsigned P3POLE                 :1;
        unsigned P3POLF                 :1;
        unsigned P3INPOL                :1;
    };
} PSMC3POLbits_t;
extern volatile PSMC3POLbits_t PSMC3POLbits __at(0x856);
// bitfield macros
#define _PSMC3POL_P3POLA_POSN                               0x0
#define _PSMC3POL_P3POLA_POSITION                           0x0
#define _PSMC3POL_P3POLA_SIZE                               0x1
#define _PSMC3POL_P3POLA_LENGTH                             0x1
#define _PSMC3POL_P3POLA_MASK                               0x1
#define _PSMC3POL_P3POLB_POSN                               0x1
#define _PSMC3POL_P3POLB_POSITION                           0x1
#define _PSMC3POL_P3POLB_SIZE                               0x1
#define _PSMC3POL_P3POLB_LENGTH                             0x1
#define _PSMC3POL_P3POLB_MASK                               0x2
#define _PSMC3POL_P3POLC_POSN                               0x2
#define _PSMC3POL_P3POLC_POSITION                           0x2
#define _PSMC3POL_P3POLC_SIZE                               0x1
#define _PSMC3POL_P3POLC_LENGTH                             0x1
#define _PSMC3POL_P3POLC_MASK                               0x4
#define _PSMC3POL_P3POLD_POSN                               0x3
#define _PSMC3POL_P3POLD_POSITION                           0x3
#define _PSMC3POL_P3POLD_SIZE                               0x1
#define _PSMC3POL_P3POLD_LENGTH                             0x1
#define _PSMC3POL_P3POLD_MASK                               0x8
#define _PSMC3POL_P3POLE_POSN                               0x4
#define _PSMC3POL_P3POLE_POSITION                           0x4
#define _PSMC3POL_P3POLE_SIZE                               0x1
#define _PSMC3POL_P3POLE_LENGTH                             0x1
#define _PSMC3POL_P3POLE_MASK                               0x10
#define _PSMC3POL_P3POLF_POSN                               0x5
#define _PSMC3POL_P3POLF_POSITION                           0x5
#define _PSMC3POL_P3POLF_SIZE                               0x1
#define _PSMC3POL_P3POLF_LENGTH                             0x1
#define _PSMC3POL_P3POLF_MASK                               0x20
#define _PSMC3POL_P3INPOL_POSN                              0x6
#define _PSMC3POL_P3INPOL_POSITION                          0x6
#define _PSMC3POL_P3INPOL_SIZE                              0x1
#define _PSMC3POL_P3INPOL_LENGTH                            0x1
#define _PSMC3POL_P3INPOL_MASK                              0x40

