MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1784/mcu.h
#define                                 PSMC3BLKF3_bit      _BIT_ACCESS(PSMC3BLKF,3)
// PSMC3BLKF<PSMC3BLKF4>
extern volatile __bit                   PSMC3BLKF4          __at(0x4364);	// @ (0x86C * 8 + 4)
#define                                 PSMC3BLKF4_bit      _BIT_ACCESS(PSMC3BLKF,4)
// PSMC3BLKF<PSMC3BLKF5>
extern volatile __bit                   PSMC3BLKF5          __at(0x4365);	// @ (0x86C * 8 + 5)
#define                                 PSMC3BLKF5_bit      _BIT_ACCESS(PSMC3BLKF,5)
// PSMC3BLKF<PSMC3BLKF6>
extern volatile __bit                   PSMC3BLKF6          __at(0x4366);	// @ (0x86C * 8 + 6)
#define                                 PSMC3BLKF6_bit      _BIT_ACCESS(PSMC3BLKF,6)
// PSMC3BLKF<PSMC3BLKF7>
extern volatile __bit                   PSMC3BLKF7          __at(0x4367);	// @ (0x86C * 8 + 7)
#define                                 PSMC3BLKF7_bit      _BIT_ACCESS(PSMC3BLKF,7)
// PSMC3BLKR<PSMC3BLKR0>
extern volatile __bit                   PSMC3BLKR0          __at(0x4358);	// @ (0x86B * 8 + 0)
#define                                 PSMC3BLKR0_bit      _BIT_ACCESS(PSMC3BLKR,0)
// PSMC3BLKR<PSMC3BLKR1>
extern volatile __bit                   PSMC3BLKR1          __at(0x4359);	// @ (0x86B * 8 + 1)
#define                                 PSMC3BLKR1_bit      _BIT_ACCESS(PSMC3BLKR,1)
// PSMC3BLKR<PSMC3BLKR2>
extern volatile __bit                   PSMC3BLKR2          __at(0x435A);	// @ (0x86B * 8 + 2)
#define                                 PSMC3BLKR2_bit      _BIT_ACCESS(PSMC3BLKR,2)
// PSMC3BLKR<PSMC3BLKR3>
extern volatile __bit                   PSMC3BLKR3          __at(0x435B);	// @ (0x86B * 8 + 3)
#define                                 PSMC3BLKR3_bit      _BIT_ACCESS(PSMC3BLKR,3)
// PSMC3BLKR<PSMC3BLKR4>
extern volatile __bit                   PSMC3BLKR4          __at(0x435C);	// @ (0x86B * 8 + 4)
#define                                 PSMC3BLKR4_bit      _BIT_ACCESS(PSMC3BLKR,4)
// PSMC3BLKR<PSMC3BLKR5>
extern volatile __bit                   PSMC3BLKR5          __at(0x435D);	// @ (0x86B * 8 + 5)
#define                                 PSMC3BLKR5_bit      _BIT_ACCESS(PSMC3BLKR,5)
// PSMC3BLKR<PSMC3BLKR6>
extern volatile __bit                   PSMC3BLKR6          __at(0x435E);	// @ (0x86B * 8 + 6)
#define                                 PSMC3BLKR6_bit      _BIT_ACCESS(PSMC3BLKR,6)
// PSMC3BLKR<PSMC3BLKR7>
extern volatile __bit                   PSMC3BLKR7          __at(0x435F);	// @ (0x86B * 8 + 7)
#define                                 PSMC3BLKR7_bit      _BIT_ACCESS(PSMC3BLKR,7)
// PSMC3DBF<PSMC3DBF0>
extern volatile __bit                   PSMC3DBF0           __at(0x4350);	// @ (0x86A * 8 + 0)
#define                                 PSMC3DBF0_bit       _BIT_ACCESS(PSMC3DBF,0)
// PSMC3DBF<PSMC3DBF1>
extern volatile __bit                   PSMC3DBF1           __at(0x4351);	// @ (0x86A * 8 + 1)
#define                                 PSMC3DBF1_bit       _BIT_ACCESS(PSMC3DBF,1)
// PSMC3DBF<PSMC3DBF2>
extern volatile __bit                   PSMC3DBF2           __at(0x4352);	// @ (0x86A * 8 + 2)
#define                                 PSMC3DBF2_bit       _BIT_ACCESS(PSMC3DBF,2)
// PSMC3DBF<PSMC3DBF3>
extern volatile __bit                   PSMC3DBF3           __at(0x4353);	// @ (0x86A * 8 + 3)
#define                                 PSMC3DBF3_bit       _BIT_ACCESS(PSMC3DBF,3)
// PSMC3DBF<PSMC3DBF4>
extern volatile __bit                   PSMC3DBF4           __at(0x4354);	// @ (0x86A * 8 + 4)
#define                                 PSMC3DBF4_bit       _BIT_ACCESS(PSMC3DBF,4)
// PSMC3DBF<PSMC3DBF5>
extern volatile __bit                   PSMC3DBF5           __at(0x4355);	// @ (0x86A * 8 + 5)
#define                                 PSMC3DBF5_bit       _BIT_ACCESS(PSMC3DBF,5)
// PSMC3DBF<PSMC3DBF6>
extern volatile __bit                   PSMC3DBF6           __at(0x4356);	// @ (0x86A * 8 + 6)
#define                                 PSMC3DBF6_bit       _BIT_ACCESS(PSMC3DBF,6)
// PSMC3DBF<PSMC3DBF7>
extern volatile __bit                   PSMC3DBF7           __at(0x4357);	// @ (0x86A * 8 + 7)
#define                                 PSMC3DBF7_bit       _BIT_ACCESS(PSMC3DBF,7)
// PSMC3DBR<PSMC3DBR0>
extern volatile __bit                   PSMC3DBR0           __at(0x4348);	// @ (0x869 * 8 + 0)
#define                                 PSMC3DBR0_bit       _BIT_ACCESS(PSMC3DBR,0)
// PSMC3DBR<PSMC3DBR1>
extern volatile __bit                   PSMC3DBR1           __at(0x4349);	// @ (0x869 * 8 + 1)
#define                                 PSMC3DBR1_bit       _BIT_ACCESS(PSMC3DBR,1)
// PSMC3DBR<PSMC3DBR2>
extern volatile __bit                   PSMC3DBR2           __at(0x434A);	// @ (0x869 * 8 + 2)
#define                                 PSMC3DBR2_bit       _BIT_ACCESS(PSMC3DBR,2)
// PSMC3DBR<PSMC3DBR3>
extern volatile __bit                   PSMC3DBR3           __at(0x434B);	// @ (0x869 * 8 + 3)
#define                                 PSMC3DBR3_bit       _BIT_ACCESS(PSMC3DBR,3)
// PSMC3DBR<PSMC3DBR4>
extern volatile __bit                   PSMC3DBR4           __at(0x434C);	// @ (0x869 * 8 + 4)
#define                                 PSMC3DBR4_bit       _BIT_ACCESS(PSMC3DBR,4)
// PSMC3DBR<PSMC3DBR5>
extern volatile __bit                   PSMC3DBR5           __at(0x434D);	// @ (0x869 * 8 + 5)
#define                                 PSMC3DBR5_bit       _BIT_ACCESS(PSMC3DBR,5)
// PSMC3DBR<PSMC3DBR6>
extern volatile __bit                   PSMC3DBR6           __at(0x434E);	// @ (0x869 * 8 + 6)
#define                                 PSMC3DBR6_bit       _BIT_ACCESS(PSMC3DBR,6)
// PSMC3DBR<PSMC3DBR7>
extern volatile __bit                   PSMC3DBR7           __at(0x434F);	// @ (0x869 * 8 + 7)
#define                                 PSMC3DBR7_bit       _BIT_ACCESS(PSMC3DBR,7)
// PSMC3DCL<PSMC3DC0>
extern volatile __bit                   PSMC3DC0            __at(0x4318);	// @ (0x863 * 8 + 0)
#define                                 PSMC3DC0_bit        _BIT_ACCESS(PSMC3DCL,0)
// PSMC3DCL<PSMC3DC1>
extern volatile __bit                   PSMC3DC1            __at(0x4319);	// @ (0x863 * 8 + 1)
#define                                 PSMC3DC1_bit        _BIT_ACCESS(PSMC3DCL,1)
// PSMC3DCH<PSMC3DC10>
extern volatile __bit                   PSMC3DC10           __at(0x4322);	// @ (0x864 * 8 + 2)
#define                                 PSMC3DC10_bit       _BIT_ACCESS(PSMC3DCH,2)
// PSMC3DCH<PSMC3DC11>
extern volatile __bit                   PSMC3DC11           __at(0x4323);	// @ (0x864 * 8 + 3)
#define                                 PSMC3DC11_bit       _BIT_ACCESS(PSMC3DCH,3)
// PSMC3DCH<PSMC3DC12>
extern volatile __bit                   PSMC3DC12           __at(0x4324);	// @ (0x864 * 8 + 4)
#define                                 PSMC3DC12_bit       _BIT_ACCESS(PSMC3DCH,4)
// PSMC3DCH<PSMC3DC13>
extern volatile __bit                   PSMC3DC13           __at(0x4325);	// @ (0x864 * 8 + 5)
#define                                 PSMC3DC13_bit       _BIT_ACCESS(PSMC3DCH,5)
// PSMC3DCH<PSMC3DC14>
extern volatile __bit                   PSMC3DC14           __at(0x4326);	// @ (0x864 * 8 + 6)
#define                                 PSMC3DC14_bit       _BIT_ACCESS(PSMC3DCH,6)
// PSMC3DCH<PSMC3DC15>
extern volatile __bit                   PSMC3DC15           __at(0x4327);	// @ (0x864 * 8 + 7)
#define                                 PSMC3DC15_bit       _BIT_ACCESS(PSMC3DCH,7)
// PSMC3DCL<PSMC3DC2>
extern volatile __bit                   PSMC3DC2            __at(0x431A);	// @ (0x863 * 8 + 2)
#define                                 PSMC3DC2_bit        _BIT_ACCESS(PSMC3DCL,2)
// PSMC3DCL<PSMC3DC3>
extern volatile __bit                   PSMC3DC3            __at(0x431B);	// @ (0x863 * 8 + 3)
#define                                 PSMC3DC3_bit        _BIT_ACCESS(PSMC3DCL,3)
// PSMC3DCL<PSMC3DC4>
extern volatile __bit                   PSMC3DC4            __at(0x431C);	// @ (0x863 * 8 + 4)
#define                                 PSMC3DC4_bit        _BIT_ACCESS(PSMC3DCL,4)
// PSMC3DCL<PSMC3DC5>
extern volatile __bit                   PSMC3DC5            __at(0x431D);	// @ (0x863 * 8 + 5)
#define                                 PSMC3DC5_bit        _BIT_ACCESS(PSMC3DCL,5)
// PSMC3DCL<PSMC3DC6>
extern volatile __bit                   PSMC3DC6            __at(0x431E);	// @ (0x863 * 8 + 6)
#define                                 PSMC3DC6_bit        _BIT_ACCESS(PSMC3DCL,6)
// PSMC3DCL<PSMC3DC7>
extern volatile __bit                   PSMC3DC7            __at(0x431F);	// @ (0x863 * 8 + 7)
#define                                 PSMC3DC7_bit        _BIT_ACCESS(PSMC3DCL,7)
// PSMC3DCH<PSMC3DC8>
extern volatile __bit                   PSMC3DC8            __at(0x4320);	// @ (0x864 * 8 + 0)
#define                                 PSMC3DC8_bit        _BIT_ACCESS(PSMC3DCH,0)
// PSMC3DCH<PSMC3DC9>
extern volatile __bit                   PSMC3DC9            __at(0x4321);	// @ (0x864 * 8 + 1)
#define                                 PSMC3DC9_bit        _BIT_ACCESS(PSMC3DCH,1)
// PSMC3CON<PSMC3EN>
extern volatile __bit                   PSMC3EN             __at(0x428F);	// @ (0x851 * 8 + 7)
#define                                 PSMC3EN_bit         _BIT_ACCESS(PSMC3CON,7)
// PSMC3FFA<PSMC3FFA0>
extern volatile __bit                   PSMC3FFA0           __at(0x4368);	// @ (0x86D * 8 + 0)
#define                                 PSMC3FFA0_bit       _BIT_ACCESS(PSMC3FFA,0)
// PSMC3FFA<PSMC3FFA1>
extern volatile __bit                   PSMC3FFA1           __at(0x4369);	// @ (0x86D * 8 + 1)
#define                                 PSMC3FFA1_bit       _BIT_ACCESS(PSMC3FFA,1)
// PSMC3FFA<PSMC3FFA2>
extern volatile __bit                   PSMC3FFA2           __at(0x436A);	// @ (0x86D * 8 + 2)
#define                                 PSMC3FFA2_bit       _BIT_ACCESS(PSMC3FFA,2)
// PSMC3FFA<PSMC3FFA3>
extern volatile __bit                   PSMC3FFA3           __at(0x436B);	// @ (0x86D * 8 + 3)
#define                                 PSMC3FFA3_bit       _BIT_ACCESS(PSMC3FFA,3)
// PSMC3CON<PSMC3LD>
extern volatile __bit                   PSMC3LD             __at(0x428E);	// @ (0x851 * 8 + 6)
#define                                 PSMC3LD_bit         _BIT_ACCESS(PSMC3CON,6)
// PSMC3PHL<PSMC3PH0>
extern volatile __bit                   PSMC3PH0            __at(0x4308);	// @ (0x861 * 8 + 0)
#define                                 PSMC3PH0_bit        _BIT_ACCESS(PSMC3PHL,0)
// PSMC3PHL<PSMC3PH1>
extern volatile __bit                   PSMC3PH1            __at(0x4309);	// @ (0x861 * 8 + 1)
#define                                 PSMC3PH1_bit        _BIT_ACCESS(PSMC3PHL,1)
// PSMC3PHH<PSMC3PH10>
extern volatile __bit                   PSMC3PH10           __at(0x4312);	// @ (0x862 * 8 + 2)
#define                                 PSMC3PH10_bit       _BIT_ACCESS(PSMC3PHH,2)
// PSMC3PHH<PSMC3PH11>
extern volatile __bit                   PSMC3PH11           __at(0x4313);	// @ (0x862 * 8 + 3)
#define                                 PSMC3PH11_bit       _BIT_ACCESS(PSMC3PHH,3)
// PSMC3PHH<PSMC3PH12>
extern volatile __bit                   PSMC3PH12           __at(0x4314);	// @ (0x862 * 8 + 4)
#define                                 PSMC3PH12_bit       _BIT_ACCESS(PSMC3PHH,4)
// PSMC3PHH<PSMC3PH13>
extern volatile __bit                   PSMC3PH13           __at(0x4315);	// @ (0x862 * 8 + 5)
#define                                 PSMC3PH13_bit       _BIT_ACCESS(PSMC3PHH,5)
// PSMC3PHH<PSMC3PH14>
extern volatile __bit                   PSMC3PH14           __at(0x4316);	// @ (0x862 * 8 + 6)
#define                                 PSMC3PH14_bit       _BIT_ACCESS(PSMC3PHH,6)
// PSMC3PHH<PSMC3PH15>
extern volatile __bit                   PSMC3PH15           __at(0x4317);	// @ (0x862 * 8 + 7)
#define                                 PSMC3PH15_bit       _BIT_ACCESS(PSMC3PHH,7)
// PSMC3PHL<PSMC3PH2>
extern volatile __bit                   PSMC3PH2            __at(0x430A);	// @ (0x861 * 8 + 2)
#define                                 PSMC3PH2_bit        _BIT_ACCESS(PSMC3PHL,2)
// PSMC3PHL<PSMC3PH3>
extern volatile __bit                   PSMC3PH3            __at(0x430B);	// @ (0x861 * 8 + 3)
#define                                 PSMC3PH3_bit        _BIT_ACCESS(PSMC3PHL,3)
// PSMC3PHL<PSMC3PH4>
extern volatile __bit                   PSMC3PH4            __at(0x430C);	// @ (0x861 * 8 + 4)
#define                                 PSMC3PH4_bit        _BIT_ACCESS(PSMC3PHL,4)
// PSMC3PHL<PSMC3PH5>
extern volatile __bit                   PSMC3PH5            __at(0x430D);	// @ (0x861 * 8 + 5)
#define                                 PSMC3PH5_bit        _BIT_ACCESS(PSMC3PHL,5)
// PSMC3PHL<PSMC3PH6>
extern volatile __bit                   PSMC3PH6            __at(0x430E);	// @ (0x861 * 8 + 6)
#define                                 PSMC3PH6_bit        _BIT_ACCESS(PSMC3PHL,6)
// PSMC3PHL<PSMC3PH7>
extern volatile __bit                   PSMC3PH7            __at(0x430F);	// @ (0x861 * 8 + 7)
#define                                 PSMC3PH7_bit        _BIT_ACCESS(PSMC3PHL,7)
// PSMC3PHH<PSMC3PH8>
extern volatile __bit                   PSMC3PH8            __at(0x4310);	// @ (0x862 * 8 + 0)
#define                                 PSMC3PH8_bit        _BIT_ACCESS(PSMC3PHH,0)
// PSMC3PHH<PSMC3PH9>
extern volatile __bit                   PSMC3PH9            __at(0x4311);	// @ (0x862 * 8 + 1)
#define                                 PSMC3PH9_bit        _BIT_ACCESS(PSMC3PHH,1)
// PSMC3PRL<PSMC3PR0>
extern volatile __bit                   PSMC3PR0            __at(0x4328);	// @ (0x865 * 8 + 0)
#define                                 PSMC3PR0_bit        _BIT_ACCESS(PSMC3PRL,0)
// PSMC3PRL<PSMC3PR1>
extern volatile __bit                   PSMC3PR1            __at(0x4329);	// @ (0x865 * 8 + 1)
#define                                 PSMC3PR1_bit        _BIT_ACCESS(PSMC3PRL,1)
// PSMC3PRH<PSMC3PR10>
extern volatile __bit                   PSMC3PR10           __at(0x4332);	// @ (0x866 * 8 + 2)
#define                                 PSMC3PR10_bit       _BIT_ACCESS(PSMC3PRH,2)
// PSMC3PRH<PSMC3PR11>
extern volatile __bit                   PSMC3PR11           __at(0x4333);	// @ (0x866 * 8 + 3)
#define                                 PSMC3PR11_bit       _BIT_ACCESS(PSMC3PRH,3)
// PSMC3PRH<PSMC3PR12>
extern volatile __bit                   PSMC3PR12           __at(0x4334);	// @ (0x866 * 8 + 4)
#define                                 PSMC3PR12_bit       _BIT_ACCESS(PSMC3PRH,4)
// PSMC3PRH<PSMC3PR13>
extern volatile __bit                   PSMC3PR13           __at(0x4335);	// @ (0x866 * 8 + 5)
#define                                 PSMC3PR13_bit       _BIT_ACCESS(PSMC3PRH,5)
// PSMC3PRH<PSMC3PR14>
extern volatile __bit                   PSMC3PR14           __at(0x4336);	// @ (0x866 * 8 + 6)
#define                                 PSMC3PR14_bit       _BIT_ACCESS(PSMC3PRH,6)
// PSMC3PRH<PSMC3PR15>
extern volatile __bit                   PSMC3PR15           __at(0x4337);	// @ (0x866 * 8 + 7)
#define                                 PSMC3PR15_bit       _BIT_ACCESS(PSMC3PRH,7)
// PSMC3PRL<PSMC3PR2>
extern volatile __bit                   PSMC3PR2            __at(0x432A);	// @ (0x865 * 8 + 2)
#define                                 PSMC3PR2_bit        _BIT_ACCESS(PSMC3PRL,2)
// PSMC3PRL<PSMC3PR3>
extern volatile __bit                   PSMC3PR3            __at(0x432B);	// @ (0x865 * 8 + 3)
#define                                 PSMC3PR3_bit        _BIT_ACCESS(PSMC3PRL,3)
// PSMC3PRL<PSMC3PR4>
extern volatile __bit                   PSMC3PR4            __at(0x432C);	// @ (0x865 * 8 + 4)
#define                                 PSMC3PR4_bit        _BIT_ACCESS(PSMC3PRL,4)
// PSMC3PRL<PSMC3PR5>
extern volatile __bit                   PSMC3PR5            __at(0x432D);	// @ (0x865 * 8 + 5)
#define                                 PSMC3PR5_bit        _BIT_ACCESS(PSMC3PRL,5)
// PSMC3PRL<PSMC3PR6>
extern volatile __bit                   PSMC3PR6            __at(0x432E);	// @ (0x865 * 8 + 6)
#define                                 PSMC3PR6_bit        _BIT_ACCESS(PSMC3PRL,6)
// PSMC3PRL<PSMC3PR7>
extern volatile __bit                   PSMC3PR7            __at(0x432F);	// @ (0x865 * 8 + 7)
#define                                 PSMC3PR7_bit        _BIT_ACCESS(PSMC3PRL,7)
// PSMC3PRH<PSMC3PR8>
extern volatile __bit                   PSMC3PR8            __at(0x4330);	// @ (0x866 * 8 + 0)
#define                                 PSMC3PR8_bit        _BIT_ACCESS(PSMC3PRH,0)
// PSMC3PRH<PSMC3PR9>
extern volatile __bit                   PSMC3PR9            __at(0x4331);	// @ (0x866 * 8 + 1)
#define                                 PSMC3PR9_bit        _BIT_ACCESS(PSMC3PRH,1)
// PIE4<PSMC3SIE>
extern volatile __bit                   PSMC3SIE            __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 PSMC3SIE_bit        _BIT_ACCESS(PIE4,2)
// PIR4<PSMC3SIF>
extern volatile __bit                   PSMC3SIF            __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 PSMC3SIF_bit        _BIT_ACCESS(PIR4,2)
// PIE4<PSMC3TIE>
extern volatile __bit                   PSMC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PSMC3TIE_bit        _BIT_ACCESS(PIE4,6)
// PIR4<PSMC3TIF>
extern volatile __bit                   PSMC3TIF            __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 PSMC3TIF_bit        _BIT_ACCESS(PIR4,6)
// PSMC3TMRL<PSMC3TMR0>
extern volatile __bit                   PSMC3TMR0           __at(0x4338);	// @ (0x867 * 8 + 0)
#define                                 PSMC3TMR0_bit       _BIT_ACCESS(PSMC3TMRL,0)
// PSMC3TMRL<PSMC3TMR1>
extern volatile __bit                   PSMC3TMR1           __at(0x4339);	// @ (0x867 * 8 + 1)
#define                                 PSMC3TMR1_bit       _BIT_ACCESS(PSMC3TMRL,1)
// PSMC3TMRH<PSMC3TMR10>
extern volatile __bit                   PSMC3TMR10          __at(0x4342);	// @ (0x868 * 8 + 2)
#define                                 PSMC3TMR10_bit      _BIT_ACCESS(PSMC3TMRH,2)
// PSMC3TMRH<PSMC3TMR11>
extern volatile __bit                   PSMC3TMR11          __at(0x4343);	// @ (0x868 * 8 + 3)
#define                                 PSMC3TMR11_bit      _BIT_ACCESS(PSMC3TMRH,3)
// PSMC3TMRH<PSMC3TMR12>
extern volatile __bit                   PSMC3TMR12          __at(0x4344);	// @ (0x868 * 8 + 4)
#define                                 PSMC3TMR12_bit      _BIT_ACCESS(PSMC3TMRH,4)
// PSMC3TMRH<PSMC3TMR13>
extern volatile __bit                   PSMC3TMR13          __at(0x4345);	// @ (0x868 * 8 + 5)
#define                                 PSMC3TMR13_bit      _BIT_ACCESS(PSMC3TMRH,5)
// PSMC3TMRH<PSMC3TMR14>
extern volatile __bit                   PSMC3TMR14          __at(0x4346);	// @ (0x868 * 8 + 6)
#define                                 PSMC3TMR14_bit      _BIT_ACCESS(PSMC3TMRH,6)
// PSMC3TMRH<PSMC3TMR15>
extern volatile __bit                   PSMC3TMR15          __at(0x4347);	// @ (0x868 * 8 + 7)
#define                                 PSMC3TMR15_bit      _BIT_ACCESS(PSMC3TMRH,7)
// PSMC3TMRL<PSMC3TMR2>
extern volatile __bit                   PSMC3TMR2           __at(0x433A);	// @ (0x867 * 8 + 2)
#define                                 PSMC3TMR2_bit       _BIT_ACCESS(PSMC3TMRL,2)
// PSMC3TMRL<PSMC3TMR3>
extern volatile __bit                   PSMC3TMR3           __at(0x433B);	// @ (0x867 * 8 + 3)
#define                                 PSMC3TMR3_bit       _BIT_ACCESS(PSMC3TMRL,3)
// PSMC3TMRL<PSMC3TMR4>
extern volatile __bit                   PSMC3TMR4           __at(0x433C);	// @ (0x867 * 8 + 4)
#define                                 PSMC3TMR4_bit       _BIT_ACCESS(PSMC3TMRL,4)
// PSMC3TMRL<PSMC3TMR5>
extern volatile __bit                   PSMC3TMR5           __at(0x433D);	// @ (0x867 * 8 + 5)
#define                                 PSMC3TMR5_bit       _BIT_ACCESS(PSMC3TMRL,5)
// PSMC3TMRL<PSMC3TMR6>
extern volatile __bit                   PSMC3TMR6           __at(0x433E);	// @ (0x867 * 8 + 6)
#define                                 PSMC3TMR6_bit       _BIT_ACCESS(PSMC3TMRL,6)
// PSMC3TMRL<PSMC3TMR7>
extern volatile __bit                   PSMC3TMR7           __at(0x433F);	// @ (0x867 * 8 + 7)
#define                                 PSMC3TMR7_bit       _BIT_ACCESS(PSMC3TMRL,7)
// PSMC3TMRH<PSMC3TMR8>
extern volatile __bit                   PSMC3TMR8           __at(0x4340);	// @ (0x868 * 8 + 0)
#define                                 PSMC3TMR8_bit       _BIT_ACCESS(PSMC3TMRH,0)
// PSMC3TMRH<PSMC3TMR9>
extern volatile __bit                   PSMC3TMR9           __at(0x4341);	// @ (0x868 * 8 + 1)
#define                                 PSMC3TMR9_bit       _BIT_ACCESS(PSMC3TMRH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
